Repository: leosal0mao/web_portfolio_flutter
Catalog: lib/l10n/app_*.arb
Languages: pt_br

source: About
pt_br: Sobre

source: Services
pt_br: Serviços

source: Recent Works
pt_br: Trabalhos

source: Contact
pt_br: Contatos

# hello
source: Hi!
pt_br: Olá!

# leonardo
source: Leo
pt_br: Léo

source: Salomao
pt_br: Salomão

# programmer
source: Software engineer, Flutter developer.
pt_br: Engenheiro de software, desenvolvedor Flutter.

source: me
pt_br: mim

# yearsExperience
source: Years of experience
pt_br: Anos de experiencia

source: Download CV
pt_br: Baixar CV

source: Hire me!
pt_br: Me contrate!

source: Mobile apps
pt_br: Aplicativos móveis

source: Web apps
pt_br: Aplicativos web

source: Video editing
pt_br: Edição de vídeos

# serviceOffering
source: Services that I offer
pt_br: Serviços que ofereço

# strongAreas
source: My strengths
pt_br: Meus pontos fortes

# startingProject
source: Starting a new project?
pt_br: Começando um novo projeto?

source: Contact me! :)
pt_br: Entre em contato! :)

source: View details
pt_br: Ver detalhes

source: My old portfolio :)
pt_br: Meu antigo portfolio :)

source: Web development
pt_br: Desenvolvimento web

# financesAppDescription
source: Mobile based application that allows users to control their finances.
pt_br: Aplicativo móvel que permite que usuários controlem suas finanças.

source: Mobile development
pt_br: Desenvolvimento mobile

# cbSongsDescription
source: Node.js discord bot made for fun, used for playing songs directly from youtube or spotify on any servers that I allow it.
pt_br: Bot feito em Node.js, usado para tocar músicas diretamente do spotify ou youtube em servidores que lhe é dado permissão.

source: Backend development
pt_br: Desenvolvimento Backend

# firstfolioDescription
source: My first portfolio, a study in Flutter web.
pt_br: Meu primeiro portfolio, um experimento com o Flutter web.

# moreInfo
source: If you want to quote a project
pt_br: Para orçar um projeto

source: Your name
pt_br: Seu nome

# enterName
source: Enter your name
pt_br: Informe seu nome

# emailAdress
source: Email address
pt_br: E-mail

# enterEmail
source: Enter your email address
pt_br: Informe seu e-mail

source: Your message
pt_br: Sua mensagem

# enterMessage
source: Enter your message
pt_br: Mensagem

source: Send!
pt_br: Enviar!

# aboutMe1
source: I am a skilled software developer with experience in Flutter, that is starting with JavaScript, studying frameworks like React, Node.js, and Three.js. I'm a quick learner and collaborate closely with clients to create efficient, scalable, and user-friendly solutions that solve real-world problems. Let's work together to bring your ideas to life!
pt_br: Sou um desenvolvedor de software com experiencia principalmente em Flutter, com conhecimentos em JavaScript, em frameworks como React, Node.js e Three.js. Tenho facilidade para aprender tecnologias novas e trabalhar em equipe com clientes para criar soluções eficientes, escaláveis e intuitivas que resolvam problemas reais. Vamos trabalhar juntos para dar vida aos seus projetos!

# aboutMe2
source: Following projects showcases my skills and experience through real-world examples of my work. Each project is briefly described with links to code repositories and live demos in it. It reflects my ability to solve complex problems, work with different technologies, and manage projects effectively.
pt_br: Os projetos a seguir mostram minhas habilidades e experiencias por meio de exemplos reais dos meus trabalhos. Cada projeto contém uma descrição e links para os seus repositórios. Isso reflete minha capacidade de resolver problemas complexos, trabalhar com diferentes tecnologias e gerenciar projetos efetivamente.

# sucessEmail
source: Thank you for the e-mail! I will contact you shortly.
pt_br: Obrigado pelo e-mail! Em breve entrarei em contato.

# failEmail
source: Failed to send the e-mail, try again later.
pt_br: Falha em enviar o e-mail, tente novamente mais tarde.
